/* жв "оБУПУ У брч" */
#include "../kernel.h"
typedef struct {
	Register_type Dist_mode;			//bit			1 - дЙУФБОГЙПООЩК ТЕЦЙН 0 - НЕУФОЩК ТЕЦЙН//0-ТБВПФБ Ч ТХЮОХА
	Register_type Cmd_ON;				//bit			лПНБОДБ ЧЛМАЮЙФШ (РПЛБ ХДЕТЦЙЧБЕФУС 1 ОЕПВИПДЙНП ЪБРХУФЙФШ об)
	Register_type Cmd_OFF;				//bit			лПНБОДБ ПФЛМАЮЙФШ (РПЛБ ХДЕТЦЙЧБЕФУС 1 ОЕПВИПДЙНП ПУФБОПЧЙФШ об)
	Register_type Actuator;				//bit			уПУФПСОЙЕ РХУЛБФЕМС 1 - ЪБНЛОХФ 0 - ТБЪПНЛОХФ
	Register_type Alarm;				//bit			бЧБТЙС (ЧЩЛМАЮЕОЙЕ РТПЙУИПДЙФ ФПМШЛП РПУМЕ ЙУФЕЮЕОЙС ЧТЕНЕОЙ ОЕПИПДЙНПЗП ОБ ЪБРХУЛ)
	Register_type Block;				//bit			вМПЛЙТПЧЛБ (РПМОБС ПУФБОПЧЛБ ДЧЙЗБФЕМС, ДБМШОЕКЫБС ТБВПФБ ЧПЪНПЦОБ ФПМШЛП РПУМЕ ResetAlarm)
	Register_type Reset;			//bit			уВТПУ БЧБТЙК(ЙНРХМШУОЩК ЧИПД ЦЕМБФЕМШОП 1 ФБЛФ ЙУРПМОЕОЙС ЛПОЖЙЗХТБГЙЙ)
	Register_type ImpulsONOFFTime;		//uint8			чТЕНС Ч УЕЛ Ч ФЕЮЕОЙЙ ЛПФПТПЗП ДЕКУФЧХЕФ ЧЩИПД ХРТБЧМЕОЙС ОБ РХУЛБФЕМШ об
	Register_type ActuatorTime;			//uint32		чТЕНС Ч УЕЛ ПЦЙДБОЙС ЦЕМБЕНПЗП УПУФПСОЙС РХУЛБФЕМС
	Register_type ActuatorRestart;		//uint16		лПМЙЮЕУФЧП РПРЩФПЛ ПЦЙДБОЙС ЦЕМБЕНПЗП УПУФПСОЙС РХУЛБФЕМС
	Register_type TimeNonStop;			//uint32		чТЕНС РХУЛБ об Ч УЕЛ (Ч ФЕЮЕОЙЙ ЛПФПТПЗП ОЕ ТЕБЗЙТПЧБФШ ОБ ФТЕЧПЗХ ОБ ЧТЕНС РХУЛБ)
	Register_type APV_TryNum;			//uint16		лПМЙЮЕУФЧП РПРЩФПЛ брч
	Register_type APV_Interval;			//uint32		чТЕНС НЕЦДХ РПРЩФЛБНЙ брч
} fb00090_IN_type;

typedef struct {
	Register_type SecTimer;				//uint8			чОХФТЕООЙК УЮЕФЮЙЛ ДМС ПФУЮЕФБ УЕЛХОД
	Register_type CntReinitAPV;			//uint32		чОХФТЕООЙК УЮЕФЮЙЛ РЕТЕЙОЙГЙБМЙЪБГЙЙ брч
} fb00090_VAR_type;

typedef struct {
	Register_type Control_ON;			//bit			чЩИПД ОБ ЧЛМАЮЕОЙЕ РХУЛБФЕМС об
	Register_type Control_OFF;			//bit			чЩИПД ОБ ЧЩЛМАЮЕОЙЕ РХУЛБФЕМС об
	Register_type stUprav;				//bit			рТЙЪОБЛ, ЮФП об ЧПУРТЙОЙНБЕФ ХРТБЧМСАЭЙЕ ЛПНБОДЩ??
	Register_type CntActTime;			//uint32		уЮЕФЮЙЛ ЧТЕНЕОЙ Ч УЕЛ ПЦЙДБОЙС УПУФПСОЙС РХУЛБФЕМС
	Register_type CntActRestart;		//uint16		уЮЕФЮЙЛ ЛПМЙЮЕУФЧБ РПРЩФПЛ ПЦЙДБОЙС УПУФПСОЙС РХУЛБФЕМС//ДМС ТЕЦЙНБ ЪБРХУЛБ РП брч
	Register_type CntNonStop;			//uint32		уЮЕФЮЙЛ ЧТЕНЕОЙ Ч УЕЛ ЧТЕНЕОЙ РХУЛБ об (ОБЮЙОБЕФ ТБВПФБФШ РПУМЕ ПЦЙДБОЙС УПУФПСОЙС РХУЛБФЕМС)
	Register_type APV_TryCnt;			//uint16		уЮЕФЮЙЛ РПРЩФПЛ брч
	Register_type APV_Timer;			//uint32		уЮЕФЮЙЛ ЧТЕНЕОЙ Ч УЕЛ РПУМЕ ЙУЮЕЪОПЧЕОЙС ФТЕЧПЗЙ 
	Register_type CntImpONOFF;			//uint8			уЮЕФЮЙЛ ЧТЕНЕОЙ Ч УЕЛ ХРТБЧМСАЭЕЗП ЧПЪДЕКУФЧЙС ОБ РХУЛБФЕМШ
	Register_type State;				//uint32		фЕЛХЭЕЕ УПУФПСОЙЕ БМЗПТЙФНБ ТБВПФЩ обупу У брч (ТБУЫЙЖТПЧЛБ ОЙЦЕ)
} fb00090_OUT_type;

//--------------- уПУФПСОЙС БМЗПТЙФНБ ТБВПФЩ обупу У брч ------------------
#define s00090_Dist			(1<<0)		//жМБЗ ДЙУФБОГЙПООПЗП ТЕЦЙНБ
#define s00090_Actuator			(1<<1)		//жМБЗ ЪБНЛОХФПЗП РХУЛБФЕМС
#define s00090_Block			(1<<2)		//рТЙЪОБЛ ОБМЙЮЙС ВМПЛЙТПЧЛЙ
#define s00090_Alarm			(1<<3)		//рТЙЪОБЛ ОБМЙЮЙС БЧБТЙЙ

#define s00090_APVon			(1<<4)		//жМБЗ ХЛБЪЩЧБАЭЙК ЮФП об ОaУФТПЕО ОБ брч(0)
#define s00090_flAlarm			(1<<5)		//жМБЗ ОБМЙЮЙС БЧБТЙЙ, УВТБУЩЧБЕФУС РП ЧИПДХ уВТПУ БЧБТЙЙ (ResetAlarm) ЙМЙ брч
#define s00090_flBlock			(1<<6)		//жМБЗ ОБМЙЮЙС ВМПЛЙТПЧЛЙ
#define s00090_WaitActuator		(1<<7)		//тЕЦЙН ПФТБВПФЛЙ пцйдбойе рхулбфемс

#define s00090_ExpectActuator		(1<<8)		//рТЙ ТЕЦЙНЕ ПФТБВПФЛЙ пцйдбойе рхулбфемс РПЛБЪЩЧБЕФ ЦЕМБЕНПЕ УПУФПСОЙЕ РХУЛБФЕМС 1-ъБНЛОХФ 0-тБЪПНЛОХФ(0)
#define s00090_WaitBlock		(1<<9)		//ОЕЙУРПМШЪХЕФУС
#define s00090_WaitAPV			(1<<10)		//пЦЙДБОЙЕ ЙОФЕТЧБМБ НЕЦДХ РПРЩФЛБНЙ брч
#define s00090_APV_TryCnt_Null		(1<<11)		//жМБЗ ЮФП ЛПОЮЙМЙЮШ РПРЩФЛЙ брч(УВТБУЩЧБЕФУС ФПМШЛП РТЙ ЙНРХМШУЕ ResetAlarm)

#define s00090_Need_ON			(1<<12)		//оЕПВИПДЙНП ЧЛМАЮЙФШ(0)
#define s00090_Need_OFF			(1<<13)		//оЕПВИПДЙНП ПФЛМАЮЙФШ(0)
#define s00090_ActuatorFail_OFF		(1<<14)		//оЕ ДПЦДБМЙУШ РХУЛБФЕМС РТЙ ЧЩЛМАЮЕОЙЙ
#define s00090_ActuatorFail_ON		(1<<15)		//оЕ ДПЦДБМЙУШ РХУЛБФЕМС РТЙ ЧЛМАЮЕОЙЙ

#define s00090_ReinitAPV		(1<<16)		//пЦЙДБОЙЕ ЙОЙГЙБМЙЪБГЙЙ брч РПУМЕ ПЮЕТЕДОПЗП БЧФПНБФЙЮЕУЛПЗП ЪБРХУЛБ РПУМЕ БЧБТЙЙ
											//Ф.Е. ЕУМЙ об ЪБРХУФЙМУС РП РПРЩФЛЕ брч, ФП ЦДЕН ЛПЗДБ РПРЩФЛЙ брч ЧЕТОХФШ Ч ОБЮБМШОПЕ ЪОБЮЕОЙЕ
#define s00090_WaitImpONOFF		(1<<17)		//жМБЗ ПЦЙДБОЙС ЙНРХМШУБ ЧЛМАЮЕОЙС ЙМЙ ПФЛМАЮЕОЙС
#define s00090_WaitImpSTOP		(1<<18)		//жМБЗ РТЙОХДЙФЕМШОПЗП ЙНРХМШУБ ПФЛМАЮЕОЙС РПУМЕ ОЕХДБЮОПЗП ЧЛМАЮЕОЙС (ОЕ ДПЦДБМЙУШ РХУЛБФЕМС ОБ ЧЛМАЮЕОЙЕ)(0)

//------------------ нБУЛЙ ХУМПЧЙК ---------------------------

#define s00090_StartMaskAPV		(s00090_Dist|s00090_Need_ON|s00090_APVon|s00090_ReinitAPV|s00090_Alarm)	//2-БС НБУЛБ ХУМПЧЙК РТЙ ЛПФПТЩИ НПЦОП ЪБРХУФЙФШ ОБУПУ
#define s00090_BlockMask		(s00090_Dist | s00090_Block | s00090_Actuator | s00090_APVon )	//НБУЛБ ХУМПЧЙК РТЙ ЛПФПТЩИ УТБВБФЩЧБЕФ ВМПЛЙТПЧЛБ
#define s00090_UpravMask		(s00090_Dist | s00090_APVon | s00090_Alarm | s00090_Block | s00090_Actuator )	//НБУЛБ ХУМПЧЙК РТЙ ЛПФПТЩИ ОБУПУ ЧПУРТЙОЙНБЕФ ЛПНБОДЩ ЧЛМАЮЕОЙС Й ПФЛМАЮЕОЙС
#define s00090_APVMask2ON		(s00090_Dist | s00090_flAlarm | s00090_APVon |  s00090_ReinitAPV|s00090_Alarm )
#define s00090_APVMask1OFF		~(s00090_APVMask1ON)
#define s00090_APVMask2OFF		~(s00090_APVMask2ON)

void fb00090_exec();

                               
u32 fb00090_var_size(u8 type);
